tap "homebrew/bundle"
# Mozilla CA certificate store
brew "ca-certificates"
# Statistics utility to count lines of code
brew "cloc"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Distributed revision control system
brew "git"
# DNS library written in C
brew "ldns"
# Mac App Store command-line interface
brew "mas"
# Port scanning utility for large networks
brew "nmap"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Password manager
cask "1password@beta"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# Web browser focusing on privacy
cask "brave-browser"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox@developer-edition"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Software for Logitech devices
cask "logi-options+"
# Online collaborative whiteboard platform
cask "miro"
# Collection of apps available by subscription
cask "setapp"
# Team communication and collaboration software
cask "slack"
# Code editor
cask "visual-studio-code-insiders"
# Rust-based terminal
cask "warp"
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "HP Smart", id: 1474276998
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Magnet", id: 441258766
mas "MainStage", id: 634159523
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
